{"data":{"site":{"siteMetadata":{"title":"Tech Blog","author":"Alamgir Qazi"}},"markdownRemark":{"id":"8057ff08-cbff-503c-90a7-97de11c9f66e","excerpt":"Ways to expose your app in Kubernetes Kubernetes is an open-source system for automating deployment, scaling, and management of…","html":"<h1>Ways to expose your app in Kubernetes</h1>\n<p>Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications built by Google. Kubernetes has now become the leader in container orchestration.\nT\nhere are different ways we can expose our Kubernetes Deployments.</p>\n<ol>\n<li>Load Balancer</li>\n</ol>\n<p>Kubernetes provides a simple HTTPS L7 Load Balancer. In order to expose a deployment, run this command in Kubectl. Here, myapp is our deployment which is available via ClusterIP but isn’t exposed to the outside world.</p>\n<p><code class=\"language-text\">kubectl expose deployment myapp - type=&quot;LoadBalancer&quot;</code></p>\n<ol start=\"2\">\n<li>Ingress</li>\n</ol>\n<p>Ingress can be considered as a fancier Load Balancer with more configurations. In Kubernetes Engine, Ingress is implemented using Cloud Load Balancing. When you create an Ingress in your cluster, Kubernetes Engine creates an HTTP(S) load balancer and configures it to route traffic to your application. We can set up several rules for our load balancer. Ingress can also help in exposing multiple services via a single host endpoint with different URLs.</p>\n<p>In order to set up Ingress, we need to do 2 things.</p>\n<ol>\n<li>\n<p>Reserve a static IP on Google Cloud.</p>\n</li>\n<li>\n<p>set up SSL of our domain. (needed if you want to expose to a custom domain e.g myapp.com instead of a reserved IP address).</p>\n</li>\n</ol>\n<p>Step 1:\nRun the following command and make sure you have Google Cloud SDK (<a href=\"https://cloud.google.com/sdk/\">https://cloud.google.com/sdk/</a>) installed and configured.</p>\n<p><code class=\"language-text\">gcloud compute addresses create kubernetes-ingress - region us-central1</code></p>\n<p>This will reserve a static IP with the name kubernetes-ingress.</p>\n<p>Step 2:\nDownload the private key for your custom domain.</p>\n<p>Run the following command to generate the RSA Private key</p>\n<p><code class=\"language-text\">openssl rsa -in private.key -out private_rsa.key</code></p>\n<p>if you get passphrase error, run this</p>\n<p><code class=\"language-text\">openssl rsa -in privateKey.pem -out newPrivateKey.pem</code></p>\n<p>Now run:</p>\n<p><code class=\"language-text\">kubectl create secret tls ingress-ssl - key private_rsa.key - cert mycert.crt</code></p>\n<p>This will create an SSL configuration named ingress-ssl. We will use this configuration for our Ingress.</p>\n<p>Here’s a yaml configuration file for Kubernetes Ingress. This yaml file can be deployed.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">apiVersion: extensions/v1beta1\nkind: Ingress\nmetadata:\nname: kubernetes-ingress\n# kubernetes-ingress is the name of static ip we&#39;ve reserved in #Google Cloud\nannotations:\nkubernetes.io/ingress.global-static-ip-name: &quot;kubernetes-ingress&quot;\nspec:\ntls:\n- hosts:\n- myapp.com\nsecretName: ingress-ssl\nbackend:\nserviceName: myapp\nservicePort: 80</code></pre></div>\n<ol>\n<li>Port-Forward</li>\n</ol>\n<p>Port-forward basically exposes a service running in Kubernetes cluster and maps it to a local port on your computer. The below command is an example. It exposes my service prometheus from namespace ‘monitoring’ and it maps it to localhost:8082. This can be ideal for testing purposes and for services that you do not want to expose to the outside world but might need for testing for your own.</p>\n<p><code class=\"language-text\">kubectl port-forward svc/prometheus - namespace monitoring 8082:9090</code></p>\n<p>Which one should you use?\nLoad Balancer is ideal if you are testing and only have a single service that you want to expose. Mostly this is not the case and thus this can become expensive.\nPort-Forward is mostly for testing locally and not an option to expose for production.\nIngress is the most likely solution as it provides more customization and offers much more.\nThere are also other ways to expose your Kubernetes service. Have a look at Istio (a service mesh) or an API Gateway like (Express-gateway for Node.js).</p>","frontmatter":{"title":"Exposing your app in Kubernetes","date":"November 08, 2018"}}},"pageContext":{"slug":"/exposing-your-app-in-kubernetes/","previous":null,"next":{"fields":{"slug":"/first-post/"},"frontmatter":{"title":"First Post"}}}}